performance/init.yaml
execution:
  concurrency: 1
  ramp-up: 0
  iterations: 1
  scenario: main

scenarios:
  main:
    script: files/init.jmx
    properties:
      base_url: http://localhost:8080/v1

reporting:
  - module: passfail
    criteria:
      No Errors: fail>=1, stop as failed

settings:
  artifacts-dir: build/init_%H_%M_%S

included-configs:
  - common/jmeter.yaml